//import db from '../lib/database.js'
import { canLevelUp } from '../lib/levelling.js'

export async function before(m, { conn }) {
    let user = global.db.data.users[m.sender]
    if (!user.autolevelup)
        return !0
    let before = user.level * 1
    while (canLevelUp(user.level, user.exp, global.multiplier))
        user.level++
    user.role = global.rpg.role(user.level).name
    if (before !== user.level) {
        m.reply(`
*यादें आए और आके ये रुलाए*
*पर तुम, यारा, क्यूँ नज़र ना आए?*

*यादें आए और आके ये रुलाए*
*पर तुम, यारा, क्यूँ नज़र ना आए?*

*ये दिल रोते-रोते तेरी ही बातें करता है*
*पर तू है कि, यारा, मेरी सुनता भी नहीं*
*ये दिल तेरी यादों में खोया-खोया रहता है*
*पर तू मेरे बारे में क्यूँ सोचता नहीं?*

*फ़िर भी आस लगी है...*
*फ़िर भी आस लगी है...*
*फ़िर भी आस लगी है दिल में*
*तुम आओगी मुझसे मिलने*
*चुपके-चुपके कह दे दिल में*
*"दीवाना"*

*हाए, कहाँ गईं वो रातें, वो मीठी-मीठी सी बातें*
*करती थीं जो दीवाना?*
*दीवाना, तेरा दीवाना*

*हाय, ऐसे कैसे कोई तोड़ता है दिल को?*
*छोड़ के हो जाना तो मिलता ही है फ़िर क्यूँ?*

*जाने कैसे कोई तोड़ता है दिल को*
*छोड़ के जाना हो तो मिलता ही है फ़िर क्यूँ?*
*तू ख़ुश हो ज़माने में, यही दुआ करता हूँ*
*हाँं, दिल में हमेशा मेरे रहेगा तू ही*
*ये दिल तेरी यादों में खोया-खोया रहता है*

*पर तू मेरे बारे में क्यूँ सोचता नहीं?*
*फ़िर भी आस लगी है...*
*फ़िर भी आस लगी है...*
*फ़िर भी आस लगी है दिल में*

*तुम आओगी मुझसे मिलने*
*चुपके-चुपके कह दे दिल में*
*"दीवाना"*

*फ़िर भी आस लगी है दिल में*
*तुम आओगी मुझसे मिलने*
*चुपके-चुपके कह दे दिल में*

*"दीवाना"*
*तेरा दीवाना*
*दीवाना, तेरा दीवाना*
\n> ARJU ♥️😒`.trim())
    }
}

